/****************************************Copyright (c)****************************************************
**                                	重庆科斯迈生物科技有限公司
**                                    6500 试剂系统                    
**																			@张校源
**
**--------------File Info---------------------------------------------------------------------------------
** File Name:               b3470.h
** Last modified Date:      2018-05-16
** Last Version:            v1.0 
** Description:             热敏电阻NTC 温度传感器 B3470
** 
**--------------------------------------------------------------------------------------------------------
** Created By:              张校源
** Created date:            2018-04-09
** Version:                 v1.0
** Descriptions:            The original version
**
**--------------------------------------------------------------------------------------------------------
** Modified by:             
** Modified date:           
** Version:                 
** Description:             
**
*********************************************************************************************************/
#ifndef __B3470_H__ 
#define __B3470_H__ 

#include "stm32f4xx.h" 

/*********************************************************************************************************
	宏定义
*********************************************************************************************************/
#define						B3470_TEMP_RANGE									71

#define 					B3470_ADC_CLOCK										RCC_APB2Periph_ADC1
#define 					B3470_ADC_PERIPH									ADC1
#define 					B3470_ADC_CHANNEL_1								ADC_Channel_2
#define 					B3470_ADC_CHANNEL_2								ADC_Channel_11

#define						B3470_IO_CLOCK_1									RCC_AHB1Periph_GPIOA
#define						B3470_IO_GPIO_PORT_1							GPIOA
#define						B3470_IO_GPIO_PIN_1								GPIO_Pin_2

#define						B3470_IO_CLOCK_2									RCC_AHB1Periph_GPIOC
#define						B3470_IO_GPIO_PORT_2							GPIOC
#define						B3470_IO_GPIO_PIN_2 							GPIO_Pin_1
#define 					B3470_ADC_FUN_CONV_TIMES 					50
#define 					B3470_ADC_FUN_OFF_TAIL						5

#define 					B3470_C3													B3470_ADC_CHANNEL_2
#define 					B3470_C2													B3470_ADC_CHANNEL_1


/*********************************************************************************************************
	外部函数
*********************************************************************************************************/
void  b3470_init(void);
int16_t b3470_get_temperature(u8 ch);
int16_t b3470_get_temperature_offset(u8 ch);
#endif

/*********************************************************************************************************
  END FILE 
*********************************************************************************************************/
